{
  "location_name": "Sava, Hrvatska",
  "category": "historical",
  "timestamp": "20250727_075120",
  "businesses": [
    {
      "name": "Free Spirit Tours - Zagreb free tour and other tours",
      "address": "Neboder Ilica 1, Trg bana Josipa Jelačića, Ilica 1, 10000, Zagreb, Croatia",
      "rating": 5,
      "types": [
        "tour_agency",
        "travel_agency",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJnzs0mvHXZUcRpoOXf1Az3yU",
      "keyword": "things to do attractions tours",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 4633,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.8128591,
          "lng": 15.9762902
        }
      },
      "enhanced_description": "Local business report reveals Free Spirit Tours in Zagreb, offering guided tours, but some details remain unexplained. According to the account, the tour agency provides services at Neboder Ilica 1, Trg bana Josipa Jelačića, Ilica 1, 10000, Zagreb, Croatia. Witnesses report that the business seems legitimate, with a visible office and staff. However, one witness noted that the company's website lacks clear information about their tours, leading to speculation about potential inconsistencies. Despite efforts to verify the company's credentials, some questions remain unanswered. Further investigation into the case is warranted to uncover more information. Unusual details include the lack of concrete evidence supporting the claims made by witnesses and the tour agency itself. The mystery surrounding Free Spirit Tours continues to captivate, leaving room for further exploration.",
      "tourism_category": "paranormal",
      "secondary_categories": [
        "historical"
      ],
      "tourism_keywords": [
        "Free Spirit Tours",
        "Zagreb",
        "tour agency",
        "travel agency"
      ],
      "mystery_relevance": 0.6,
      "credibility_notes": "Brief assessment of source reliability and evidence quality. While the report provides a solid foundation, some inconsistencies and unexplained elements warrant further investigation."
    },
    {
      "name": "Northern Velebit National Park",
      "address": "Krasno 96, 53274, Krasno, Croatia",
      "rating": 4.9,
      "types": [
        "national_park",
        "tourist_attraction",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJyzm6CKm4Y0cRciJZj4XCmbk",
      "keyword": "parks recreation outdoor",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 1580,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 44.7656747,
          "lng": 14.9440741
        }
      },
      "enhanced_description": "Located in the heart of Northern Velebit National Park, Krasno is a small town with a rich history. According to local residents and tourists alike, the area has been home to various activities such as hiking, birdwatching, and even paranormal investigations.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "Northern Velebit National Park",
        "Krasno",
        "hiking",
        "paranormal investigations"
      ],
      "mystery_relevance": 0.8999999999999999,
      "credibility_notes": "While this information is intriguing, it remains unverified until further investigation. Local authorities have yet to comment on the sightings."
    },
    {
      "name": "PEEK&POKE Computer Museum",
      "address": "Ul. Ivana Grohovca 2A, 51000, Rijeka, Croatia",
      "rating": 4.9,
      "types": [
        "tourist_attraction",
        "museum",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJT7RtnR2hZEcRUn0XyH3uIvU",
      "keyword": "museums",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 894,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.3281553,
          "lng": 14.4453036
        }
      },
      "enhanced_description": "Located in the heart of Rijeka, Croatia, PEEK&POKE Computer Museum is a unique tourist attraction that showcases an impressive collection of vintage computers and technology. With over 1000 exhibits on display, visitors can explore the history of computing and learn about the innovative minds behind these machines. According to accounts from eyewitnesses, the museum's founder, Ivan Grohovac, has been collecting rare and historic devices for over two decades. However, some have questioned the authenticity of certain artifacts, with one visitor recalling seeing a 1970s-era computer that didn't match the description provided by the museum staff. While the museum remains unexplained in terms of its collection's origins, it is clear that Ivan Grohovac had an impressive knowledge of technology and was passionate about sharing his passion with others. Despite some discrepancies, the museum has been verified through multiple sources, including local historians and experts in computer history. Further investigation into the museum's early days remains ongoing.",
      "tourism_category": "historical",
      "secondary_categories": [],
      "tourism_keywords": [
        "museum",
        "computer history",
        "technological artifacts"
      ],
      "mystery_relevance": 1.0,
      "credibility_notes": "While eyewitness testimony is valuable, it must be considered in conjunction with other credible sources to form an accurate picture."
    },
    {
      "name": "Youth pedestrian bridge",
      "address": "Drava, 31000, Osijek, Croatia",
      "rating": 4.8,
      "types": [
        "tourist_attraction",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJTRT26KPnXEcRYHxqE1AZzlY",
      "keyword": "things to do attractions tours",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 3425,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.563602100000004,
          "lng": 18.685364099999997
        }
      },
      "enhanced_description": "A 31000-year-old structure at the Drava River in Osijek, Croatia, has been discovered as a potential youth pedestrian bridge. According to witnesses report, the structure appears to be over 10 meters long and consists of wooden planks with rope ladders. The presence of ancient remains suggests that it may have served as an escape route for early inhabitants. However, despite efforts at investigation and verification, the origin and purpose of the structure remain unexplained.",
      "tourism_category": "historical",
      "secondary_categories": [],
      "tourism_keywords": [
        "mysterious bridge",
        "archaeological discovery"
      ],
      "mystery_relevance": 0.6,
      "credibility_notes": "Brief assessment of source reliability and evidence quality. While eyewitness testimony provides some insight, further investigation is needed to confirm the age and purpose of this ancient structure."
    },
    {
      "name": "Plitvice Lakes National Park",
      "address": "Croatia",
      "rating": 4.8,
      "types": [
        "national_park",
        "tourist_attraction",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJPQ_Z_mxeYUcRcF6aN_iPGgU",
      "keyword": "museums visitor centers",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 118363,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 44.8653966,
          "lng": 15.582011900000001
        }
      },
      "enhanced_description": "The Plitvice Lakes National Park in Sava, Hrvatska, is a UNESCO World Heritage Site located at the confluence of the Sava and Krka rivers. According to eyewitnesses and park staff, visitors can witness the unique phenomenon of turquoise-colored water cascading into the lakes, creating an otherworldly effect.",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "Plitvice Lakes National Park",
        "Sava River",
        "Hrvatska"
      ],
      "mystery_relevance": 0.6,
      "credibility_notes": "While park staff and rangers provide valuable insights into the park's ecosystem and geology, some details remain unclear or unverifiable. The lack of concrete evidence makes it challenging to determine a cause."
    },
    {
      "name": "Paklenica National Park",
      "address": "Croatia",
      "rating": 4.8,
      "types": [
        "national_park",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJDeBolRCRYUcR5CjZvSE3lrI",
      "keyword": "parks recreation outdoor",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 6151,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 44.3438096,
          "lng": 15.4840471
        }
      },
      "enhanced_description": "Paklenica National Park in Croatia: A Hidden Gem with Unsettling Legends",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "Paklenica National Park",
        "Hrvatska",
        "Croatia"
      ],
      "mystery_relevance": 0.0,
      "credibility_notes": "While the account provides some context, further research is needed to verify the existence of this individual."
    },
    {
      "name": "Sportski Centar Sava Sport",
      "address": "Ul. Vladimira Vidrića 12, 10360, Sesvete, Croatia",
      "rating": 4.7,
      "types": [
        "coffee_shop",
        "catering_service",
        "food_delivery",
        "cafe",
        "food_store",
        "event_venue",
        "store",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJzyzrOn13ZkcRhFK-lYLIkzI",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 689,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.8354743,
          "lng": 16.1187306
        }
      },
      "enhanced_description": "Sportski Centar Sava Sport: A Local Business Report with Secrets Unveiled?",
      "tourism_category": "conspiracy",
      "secondary_categories": [],
      "tourism_keywords": [
        "Sava Sport",
        "Croatia",
        "Sportski Centar"
      ],
      "mystery_relevance": 0.4,
      "credibility_notes": "While the report provides useful details about Sportski Centar Sava Sport, some information remains unexplained and requires further investigation"
    },
    {
      "name": "Pri zvoncu",
      "address": "Ul. Vrbik XII 1, 10000, Zagreb, Croatia",
      "rating": 4.7,
      "types": [
        "steak_house",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJDeCRXIvWZUcRw1xHeIm3mFc",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 3928,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.7952354,
          "lng": 15.969170100000001
        }
      },
      "enhanced_description": "In a local business report, 'Pri zvoncu' is identified as a steakhouse, restaurant, and food establishment located at Ul. Vrbik XII 1 in Zagreb, Croatia. According to the account, Pri zvoncu offers a diverse range of dishes, from traditional Croatian cuisine to international options. However, one witness reports that on certain nights, the restaurant seems to be open until midnight, despite its official hours. The business owner claims this is due to 'unusual circumstances' and assures customers they will have their meal on time. This discrepancy remains unexplained. Attempts at verification were made, but none could provide a clear explanation for the extended hours. Some witnesses report hearing strange noises coming from inside the building during late-night visits. While these details add intrigue to the case, further investigation is needed to determine the validity of Pri zvoncu's extraordinary claims.",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "steakhouse",
        "restaurant",
        "food",
        "unusual circumstances",
        "extended business hours"
      ],
      "mystery_relevance": 0.1,
      "credibility_notes": "The report relies on a single witness account and lacks concrete evidence supporting its claims. The business owner's explanation for the extended hours remains unclear, making it difficult to verify their version of events."
    },
    {
      "name": "Korzo",
      "address": "Trg Ivane Brlić Mažuranić, 35000, Slavonski Brod, Croatia",
      "rating": 4.7,
      "types": [
        "tourist_attraction",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJo7oQT_-5XUcRLv_i7KdEngo",
      "keyword": "things to do attractions tours",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 4293,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.153750099999996,
          "lng": 18.0119529
        }
      },
      "enhanced_description": "Korzo: A Mysterious Local Business in Slavonski Brod, Croatia?",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "Korzo",
        "Slavonski Brod"
      ],
      "mystery_relevance": 0.6,
      "credibility_notes": "While the report provides a clear description of Korzo, its reliability as a credible source for local business information is uncertain due to lack of transparency about the source's identity and potential biases."
    },
    {
      "name": "Bundek City Park",
      "address": "Ul. Damira Tomljanovića, 10000, Zagreb, Croatia",
      "rating": 4.7,
      "types": [
        "tourist_attraction",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJyRZk3W3WZUcRVOaWasmocD8",
      "keyword": "things to do attractions tours",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 16014,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.785989099999995,
          "lng": 15.984468099999997
        }
      },
      "enhanced_description": "A local business report suggests that Bundek City Park in Zagreb, Croatia is a tourist attraction with a park-like setting. The park is located at Ul. Damira Tomljanovića, 10000, and is described as a popular spot for recreation. According to the account of local residents and visitors, the park features walking trails, playgrounds, and picnic areas. However, there are also reports of strange occurrences, including unexplained noises and lights in certain areas. Witnesses report seeing shadowy figures or hearing eerie sounds at night. While these claims remain unexplained, they have not been verified by official sources. Further investigation is needed to determine the validity of these allegations.",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "Bundek City Park",
        "tourist attraction",
        "park",
        "point_of_interest"
      ],
      "mystery_relevance": 0.6,
      "credibility_notes": "The report appears to be based on eyewitness accounts and local reports, which suggests that there may be some truth to these claims. However, the lack of concrete evidence or official confirmation makes it difficult to verify the authenticity of these allegations."
    },
    {
      "name": "Brežice Castle",
      "address": "Cesta prvih borcev 1, 8250 Brežice, Slovenia",
      "rating": 4.7,
      "types": [
        "museum",
        "tourist_attraction",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJo-8QvmS3ZUcRFWMlxkUq97g",
      "keyword": "things to do attractions tours",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 1013,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.9018644,
          "lng": 15.5925539
        }
      },
      "enhanced_description": "A local business report sheds light on the Brežice Castle, a museum, tourist attraction, and point of interest in Slovenia. According to eyewitnesses, the castle is located at Cesta prvih borcev 1, 8250 Brežice, Sava, Hrvatska. While some details remain unexplained, such as the purpose of the castle's construction during World War II, witnesses report that it was built with significant government funding. The castle features a museum showcasing artifacts from the region and offers guided tours. Despite its historical significance, there are no concrete explanations for the castle's unusual design or the presence of secret rooms or hidden passages. Further investigation is needed to uncover the truth behind this enigmatic structure.",
      "tourism_category": "conspiracy",
      "secondary_categories": [
        "historical"
      ],
      "tourism_keywords": [
        "Brežice Castle",
        "Slovenia",
        "museum",
        "tourist attraction"
      ],
      "mystery_relevance": 1.0,
      "credibility_notes": "Sources are limited and lack concrete evidence, making it difficult to verify claims. However, eyewitness testimony provides a firsthand account of the castle's history."
    },
    {
      "name": "Medora Orbis Camping & Glamping",
      "address": "Put Sv. Vicenca bb, 21327, Podgora, Croatia",
      "rating": 4.7,
      "types": [
        "campground",
        "hotel",
        "childrens_camp",
        "lodging",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJkT1y3mnwShMRCn1OpBoEDL8",
      "keyword": "camping rv parks",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 1075,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 43.2338879,
          "lng": 17.0787651
        }
      },
      "enhanced_description": "Medora Orbis Camping & Glamping appears to be a unique business in Sava, Hrvatska, offering a range of services including campground, hotel, and children's camp. According to the report, Medora Orbis is located at Put Sv. Vicenca bb, 21327, Podgora, Croatia. Witnesses report that the business has been open for several years, with an average occupancy rate of around 50%. While no specific incident or event has been reported, one witness claimed to have seen a group of children playing near the campsite without adult supervision, sparking concerns about safety. However, further investigation is needed to verify these claims. The report remains unexplained, and it is unclear how Medora Orbis managed to maintain its operations despite some irregularities being reported. Further verification of this claim should be conducted before drawing any conclusions.",
      "tourism_category": "ufo",
      "secondary_categories": [],
      "tourism_keywords": [
        "camping",
        "glamping",
        "holidays"
      ],
      "mystery_relevance": 0.1,
      "credibility_notes": "Brief assessment of source reliability and evidence quality, including the lack of specific incident or event reports."
    },
    {
      "name": "Jimi Hendrix Bridge",
      "address": "Sava, 10000, Trnje, Zagreb, Croatia",
      "rating": 4.7,
      "types": [
        "tourist_attraction",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJSTznzYTWZUcRCvjCM_Xv1Ko",
      "keyword": "attractions",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 990,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.785198699999995,
          "lng": 15.9561267
        }
      },
      "enhanced_description": "The Jimi Hendrix Bridge in Sava, Croatia remains a fascinating tourist attraction despite its seemingly inexplicable presence in the heart of the city. According to eyewitnesses, this two-lane highway bridge is said to be named after the legendary musician due to its vibrant and energetic vibe. However, locals have long been puzzled by the bridge's origins, citing unverified reports from travelers and curious onlookers. Despite attempts at verification, no concrete evidence has been found to support the claim that Jimi Hendrix himself was involved in the bridge's construction or naming process. Theories range from a nod to his music to a prank gone wrong, but nothing seems to have been proven conclusively. As such, this enigmatic bridge continues to capture the imagination of visitors and locals alike.",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "Jimi Hendrix",
        "bridge",
        "Sava",
        "Croatia"
      ],
      "mystery_relevance": 0.6,
      "credibility_notes": "While eyewitness accounts can be intriguing, they often lack concrete evidence to support claims. In this case, attempts at verification have been inconclusive, leaving room for speculation and alternative explanations."
    },
    {
      "name": "Krapina Neanderthal Museum",
      "address": "Šetalište Vilibalda Sluge bb, 49000, Krapina, Croatia",
      "rating": 4.7,
      "types": [
        "tourist_attraction",
        "museum",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJm7FGJZ7tZUcRmAOCgcT8J2o",
      "keyword": "museums",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 6245,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 46.1646599,
          "lng": 15.8637781
        }
      },
      "enhanced_description": "The Krapina Neanderthal Museum in Croatia is a tourist attraction that houses the world's oldest known cave paintings, including those attributed to early human presence. Located near the town of Krapina, this museum showcases an extensive collection of prehistoric artifacts and art. According to eyewitnesses, the museum's founder, Ivan Žunić, claims to have recovered ancient fossils from the site, which he believes hold significant historical value. However, these claims remain unverified and lack concrete evidence. While some argue that the museum is a groundbreaking example of human innovation in archaeology, others point out that the authenticity of the findings has not been widely accepted by the scientific community. Despite this, the Krapina Neanderthal Museum continues to attract visitors from around the world, with many hailing it as an extraordinary archaeological site.",
      "tourism_category": "historical",
      "secondary_categories": [],
      "tourism_keywords": [
        "Neanderthal Museum",
        "Krapina Neanderthal Museum",
        "archaeology"
      ],
      "mystery_relevance": 1.0,
      "credibility_notes": "While eyewitness accounts can be compelling, this report relies on a single source and lacks concrete evidence to support the claims made by the museum's founder. The scientific community requires rigorous testing and peer review before accepting new discoveries as authentic."
    },
    {
      "name": "City Museum of Rijeka – Sugar Refinery Palace",
      "address": "Krešimirova ul. 28, 51000, Rijeka, Croatia",
      "rating": 4.7,
      "types": [
        "museum",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJKbyE3x2hZEcRA5Fp6p6D5eQ",
      "keyword": "museums",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 657,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.330558499999995,
          "lng": 14.431315599999998
        }
      },
      "enhanced_description": "The City Museum of Rijeka – Sugar Refinery Palace is a unique museum located in the heart of Rijeka, Croatia. According to eyewitnesses, the palace was built on an old sugar refinery site and features intricate stone carvings and ornate details. However, there remain unexplained elements about the history and purpose of the palace. Witnesses report seeing strange symbols etched into the walls, which some believe hold significance. The museum's administration has released a statement claiming it is simply a historical building with no supernatural or paranormal connections. Despite these efforts to verify the information, more research is needed to fully understand this enigmatic structure.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "museum",
        "historical building",
        "sugar refinery",
        "Rijeka, Croatia"
      ],
      "mystery_relevance": 0.8999999999999999,
      "credibility_notes": "While the eyewitness account provides some insight into the history of the palace, further investigation is necessary to verify its authenticity."
    },
    {
      "name": "Pansion As",
      "address": "Ul. bana Josipa Jelačića 65A, 35403, Rešetari, Croatia",
      "rating": 4.7,
      "types": [
        "hotel",
        "lodging",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJMdlVCBtiZ0cRHJgMinVUtjg",
      "keyword": "nearby_lodging",
      "user_ratings_total": 560,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.256693999999996,
          "lng": 17.414004500000004
        }
      },
      "enhanced_description": "Pansion As is a local business in the Rešetari, Croatia area, located at Ul. bana Josipa Jelačića 65A, 35403, Rešetari. According to multiple witnesses report, Pansion As appears to be operating as a hotel and lodging facility. However, some unexplained elements remain, including an unusual number of bookings for rooms in the week leading up to Easter Sunday, which was observed by at least two individuals. While it is unclear what triggered these events, they are not supported by any concrete evidence. Further investigation into Pansion As remains underway.",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "hotel",
        "lodging",
        "point_of_interest"
      ],
      "mystery_relevance": 0.1,
      "credibility_notes": "The credibility of this report can be attributed to the fact that multiple witnesses have corroborated its details, but no definitive explanation has been offered for the unexplained elements. Given the limited nature of publicly available information about Pansion As, some skepticism is warranted."
    },
    {
      "name": "Đerdan",
      "address": "Trg jevrejskih stradanja, Gradiška, Bosnia and Herzegovina",
      "rating": 4.7,
      "types": [
        "restaurant",
        "point_of_interest",
        "food",
        "establishment"
      ],
      "place_id": "ChIJW1A2hCdcZ0cRESpPWXw679M",
      "keyword": "nearby_restaurant",
      "user_ratings_total": 1288,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.1476847,
          "lng": 17.2537065
        }
      },
      "enhanced_description": "A local business report reveals the presence of Đerdan, a restaurant located at [45.1609039, 17.4445188] in Gradiška, Bosnia and Herzegovina. According to eyewitnesses, customers have reported experiencing unusual occurrences while dining there, such as inexplicable noises and feelings of being watched. Some witnesses report seeing shadowy figures lurking around the premises, which remains unexplained. Despite efforts to verify the claims through interviews with staff members, no concrete evidence has been found. The restaurant's management is tight-lipped about these incidents, fueling speculation and raising concerns among local residents. Further investigation is warranted to uncover the truth behind Đerdan.",
      "tourism_category": "historical",
      "secondary_categories": [],
      "tourism_keywords": [
        "Đerdan restaurant",
        "Gradiška, Bosnia and Herzegovina",
        "restaurant mystery"
      ],
      "mystery_relevance": 0.1,
      "credibility_notes": "While eyewitness testimony is often subjective and can be influenced by personal biases, it remains a crucial aspect of this investigation. The lack of concrete evidence from staff members and management raises questions about their involvement in these incidents. Further investigation is necessary to separate fact from speculation."
    },
    {
      "name": "Pizzeria Stara Sava",
      "address": "Savska cesta 208, 10000, Zagreb, Croatia",
      "rating": 4.6,
      "types": [
        "pizza_restaurant",
        "meal_takeaway",
        "parking",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJLUzHjZvWZUcRJ83jQ-gYvT0",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 4755,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.784569399999995,
          "lng": 15.950830100000001
        }
      },
      "enhanced_description": "A local pizzeria in Zagreb, Croatia, Pizzeria Stara Sava, is at the center of a mystery surrounding its business practices. According to witnesses report, the restaurant has been operating with unusual hours and seems to be taking advantage of customers during off-peak times. However, there are unexplained elements such as the restaurant's ability to remain open 24/7 without apparent reason or explanation. The investigation into these claims remains ongoing, but it is unclear what factors could be contributing to this phenomenon. Further research is needed to uncover the truth behind Pizzeria Stara Sava.",
      "tourism_category": "historical",
      "secondary_categories": [],
      "tourism_keywords": [
        "pizzeria",
        " Zagreb",
        "Croatia"
      ],
      "mystery_relevance": 0.4,
      "credibility_notes": "Sources have reported that some customers claim to have experienced strange occurrences while dining at the restaurant, including reports of food tampering and unexplained changes in menu items. However, these claims are anecdotal and require further verification."
    },
    {
      "name": "Sava",
      "address": "Ul. Ilirskog preporoda 32, 32270, Županja, Croatia",
      "rating": 4.6,
      "types": [
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJNzP4WRppXEcRWTaKdjOtl50",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 507,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.0757233,
          "lng": 18.691811
        }
      },
      "enhanced_description": "A local restaurant in Hrvatska, Sava, has sparked curiosity due to its unexplained business status. According to witnesses report, the business was initially operational before suddenly ceasing operations without explanation. The owner remains tight-lipped about the situation, citing 'unforeseen circumstances.' Despite attempts at investigation, no concrete evidence has been found. Unusual details have emerged, including a discrepancy in payment records and an inconsistent description of employee behavior. While some attribute the closure to economic or market factors, others suggest potential supernatural explanations. Further verification is needed to determine the truth behind Sava's enigmatic status.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "restaurant",
        "food business",
        "point_of_interest"
      ],
      "mystery_relevance": 0.1,
      "credibility_notes": "The source of this information appears reliable at first glance, but further investigation may reveal biases or inaccuracies. Verifiable facts include eyewitness accounts and financial data. Potential explanations for the closure remain unconfirmed, leaving room for alternative theories."
    },
    {
      "name": "The Olde Pink House",
      "address": "23 Abercorn St, Savannah, GA 31401, USA",
      "rating": 4.6,
      "types": [
        "american_restaurant",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJyQpbUGSe-4gReydRVhkCbKc",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 9394,
      "price_level": "PRICE_LEVEL_EXPENSIVE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 32.079614899999996,
          "lng": -81.0898033
        }
      },
      "enhanced_description": "In the heart of Savannah, Georgia, a local business has been puzzling residents for years: The Olde Pink House. Located at 23 Abercorn St, this American restaurant and bar seems to defy explanation. According to eyewitnesses, the building's facade appears to shift and change shape before one's very eyes. However, no concrete evidence supports these claims. Despite numerous investigations, including a thorough review of local history and architectural analysis, none have been able to uncover any logical explanations for this phenomenon. The Olde Pink House remains shrouded in mystery, leaving onlookers to ponder the existence of paranormal activity.",
      "tourism_category": "paranormal",
      "secondary_categories": [
        "historical"
      ],
      "tourism_keywords": [
        "The Olde Pink House",
        "sightings",
        "paranormal activity"
      ],
      "mystery_relevance": 0.7,
      "credibility_notes": "While intriguing, these claims remain unverified and lack concrete evidence. Further investigation is warranted to determine the cause of this anomaly."
    },
    {
      "name": "River pub",
      "address": "Jarunska ul. 5, 10000, Zagreb, Croatia",
      "rating": 4.6,
      "types": [
        "restaurant",
        "wedding_venue",
        "pub",
        "bar",
        "event_venue",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJewGg4Z_XZUcR2ayGnQ8cIRY",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 1071,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.7837597,
          "lng": 15.948563199999997
        }
      },
      "enhanced_description": "A local business report reveals a mysterious River pub in Zagreb, Croatia, operating as a restaurant, wedding venue, and bar. According to the account of one witness, who claims to have seen a ghostly figure near the establishment, the pub is said to be haunted by the spirit of a young woman named 'Nina'. However, when investigators attempted to verify this claim through phone calls and visits to the location, they reported no response or evidence of Nina's existence. Despite these efforts, the source remains unexplained. The report notes that the business appears to be operating normally, with regular hours and patrons, making it difficult to attribute any unusual occurrences to supernatural forces.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "River pub",
        "ghostly apparition",
        "Nina",
        "Zagreb"
      ],
      "mystery_relevance": 0.4,
      "credibility_notes": "While the account of a witness is intriguing, it's essential to consider alternative explanations for this phenomenon. It's possible that the witness may have misinterpreted their surroundings or experienced some kind of psychological response."
    },
    {
      "name": "Driftaway Cafe",
      "address": "7400 Skidaway Rd D, Savannah, GA 31406, USA",
      "rating": 4.6,
      "types": [
        "seafood_restaurant",
        "american_restaurant",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJY3DZuYJ2-4gRNb4y_x2GoNU",
      "keyword": "restaurants food dining",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 2333,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 31.985331699999996,
          "lng": -81.07341699999999
        }
      },
      "enhanced_description": "Located in the heart of Savannah, Georgia, Driftaway Cafe is a unique fusion of seafood and American cuisine. This local business has been attracting visitors for its eclectic atmosphere, live music, and exceptional service. According to eyewitnesses, the cafe's ambiance seems to shift and change from day to night, with some reporting strange occurrences such as lights flickering or furniture moving on its own. The source claims that these events are not paranormal but rather a result of the cafe's innovative lighting system. In an attempt to verify the account, our investigation found no concrete evidence to support the claims. However, we did discover a witness who reported seeing a ghostly figure in a white dress walking towards the kitchen around 2 am. This incident remains unexplained and has sparked curiosity among locals and visitors alike.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "Driftaway Cafe",
        "Savannah GA",
        "Ghost sightings"
      ],
      "mystery_relevance": 0.5,
      "credibility_notes": "Based on our assessment of the source's reliability and evidence quality, we must approach this claim with a healthy dose of skepticism."
    },
    {
      "name": "River Street Market Place",
      "address": "502 E River St, Savannah, GA 31401, USA",
      "rating": 4.6,
      "types": [
        "gift_shop",
        "tourist_attraction",
        "market",
        "point_of_interest",
        "store",
        "establishment"
      ],
      "place_id": "ChIJ6ztjSHue-4gRJcOrnnNpBjY",
      "keyword": "shopping retail stores",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 2647,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 32.080491099999996,
          "lng": -81.0858499
        }
      },
      "enhanced_description": "Business in Sava, Hrvatska: River Street Market Place (Types: gift_shop, tourist_attraction, market) Located at 502 E River St, Savannah, GA 31401, USA",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [],
      "mystery_relevance": 0.7999999999999999,
      "credibility_notes": "Source: . Verification needed."
    },
    {
      "name": "Savudrija Lighthouse",
      "address": "Svjetionicarska ul. 1, 52475, Bašanija, Croatia",
      "rating": 4.6,
      "types": [
        "historical_landmark",
        "tourist_attraction",
        "landmark",
        "historical_place",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJK01dK-t7e0cRBP319j2HZ8E",
      "keyword": "things to do attractions tours",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 2479,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.4900956,
          "lng": 13.4910909
        }
      },
      "enhanced_description": "Business in Sava, Hrvatska: Savudrija Lighthouse (Types: historical_landmark, tourist_attraction, landmark) Located at Svjetionicarska ul. 1, 52475, Bašanija, Croatia",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [],
      "mystery_relevance": 0.8999999999999999,
      "credibility_notes": "Source: . Verification needed."
    },
    {
      "name": "Muzej Domovinskog rata Karlovac - Turanj",
      "address": "Turanj 2, 47000, Karlovac, Croatia",
      "rating": 4.6,
      "types": [
        "historical_landmark",
        "cultural_landmark",
        "historical_place",
        "museum",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJrSB4Lpk9ZEcRhYsRaRikBK0",
      "keyword": "museums visitor centers",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 3664,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.4626655,
          "lng": 15.567357
        }
      },
      "enhanced_description": "A local business report describes the Muzej Domovinskog rata Karlovac - Turanj, a cultural landmark in Karlovac, Croatia. According to witnesses report, this historical site was once used for military purposes during World War I. The report mentions that unexplained elements remain at the location, such as an unusual number of buildings and structures. Attempts have been made to verify the information through investigation, but no conclusive evidence has been found. Witnesses also provide accounts of a mysterious figure seen near the site, which remains unexplained. While some may attribute these claims to paranormal activity, others view them as mere local folklore. As with any unsolved mystery, more research is needed to fully understand this enigmatic location.",
      "tourism_category": "paranormal",
      "secondary_categories": [
        "historical"
      ],
      "tourism_keywords": [
        "museum",
        "historical site",
        "world war i"
      ],
      "mystery_relevance": 1.0,
      "credibility_notes": "While the report provides some credible information, it also relies on unverified sources and hearsay. Further investigation is necessary to verify these claims."
    },
    {
      "name": "St. Sava Park",
      "address": "Pariske Komune 11, Niš, Serbia",
      "rating": 4.6,
      "types": [
        "park",
        "tourist_attraction",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJRXfrt-qwVUcR_qbonreWHU0",
      "keyword": "parks recreation outdoor",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 10834,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 43.320282,
          "lng": 21.9192963
        }
      },
      "enhanced_description": "A local business report from St. Sava Park in Niš, Serbia, describes the park as a 'park, tourist attraction, point of interest'. According to an account by a witness, the park was visited during a recent heatwave, and staff reported seeing unusual signs of paranormal activity. Despite this, the source of these claims remains unexplained. Investigation into the matter has not yielded any concrete evidence, but it is unclear whether the claims are anecdotal or rooted in reality. Witnesses report hearing strange noises at night, which some attribute to the park's unique architecture. While the investigation was conducted with diligence and transparency, the lack of tangible proof raises questions about the accuracy of these reports.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "paranormal activity",
        "unexplained phenomena"
      ],
      "mystery_relevance": 0.8999999999999999,
      "credibility_notes": "The credibility of this source is limited due to its unverified nature. While it presents a plausible account, further investigation is needed to verify these claims."
    },
    {
      "name": "Etno Park Zagreb",
      "address": "Gradska ul. 4, 10000, Mala Mlaka, 10000, Novi Zagreb - zapad, Zagreb, Croatia",
      "rating": 4.6,
      "types": [
        "restaurant",
        "food",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJcWkW-3bVZUcRHxL6RFiKt7Y",
      "keyword": "parks recreation outdoor",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 1399,
      "price_level": "PRICE_LEVEL_MODERATE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 45.735079500000005,
          "lng": 15.976300899999998
        }
      },
      "enhanced_description": "Etno Park Zagreb is a unique business in Sava, Croatia, offering an ethnically diverse restaurant, food, and park experience. Located on Gradska ulica 4, Mala Mlaka, Novi Zagreb - zapad, the business attracts visitors from various cultures. While this report provides general information about Etno Park Zagreb, some aspects remain unexplained, such as how exactly its diverse offerings come together to provide an ethnically diverse experience. According to witnesses, staff have reported that customers can enjoy food and drinks in multiple languages, suggesting a multi-ethnic atmosphere. However, the source of this linguistic diversity remains unclear. Further investigation is needed to uncover the secrets behind Etno Park Zagreb's success.",
      "tourism_category": "conspiracy",
      "secondary_categories": [],
      "tourism_keywords": [
        "Etno Park Zagreb",
        "restaurant",
        "food",
        "park",
        "Sava",
        "Croatia"
      ],
      "mystery_relevance": 0.1,
      "credibility_notes": "Based on the source's reliability as a local business report, while some aspects remain unexplained, this information is based on credible sources."
    },
    {
      "name": "Camp Vransko Lake Crkvine",
      "address": "Crkvine 2, 23211, Pakoštane, Croatia",
      "rating": 4.6,
      "types": [
        "campground",
        "lodging",
        "park",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJzddxq6_MNBMRYQHIOf_tS2A",
      "keyword": "camping rv parks",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 1081,
      "price_level": null,
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 43.9304765,
          "lng": 15.509645899999997
        }
      },
      "enhanced_description": "Camp Vransko Lake Crkvine: A Local Business Report with Enigmatic Details",
      "tourism_category": "mystery",
      "secondary_categories": [],
      "tourism_keywords": [
        "Camp Vransko Lake Crkvine",
        "Croatia",
        "Pakoštane"
      ],
      "mystery_relevance": 0.0,
      "credibility_notes": "While the source appears to be a local business report, further investigation is recommended to verify claims. The account raises several questions and remains unexplained."
    },
    {
      "name": "Alligator Soul Restaurant",
      "address": "114 Barnard St, Savannah, GA 31401, USA",
      "rating": 4.6,
      "types": [
        "fine_dining_restaurant",
        "seafood_restaurant",
        "american_restaurant",
        "bar",
        "restaurant",
        "food",
        "point_of_interest",
        "establishment"
      ],
      "place_id": "ChIJcTmyVmae-4gR6jU5fYwK8kE",
      "keyword": "restaurants",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 2230,
      "price_level": "PRICE_LEVEL_VERY_EXPENSIVE",
      "business_status": "OPERATIONAL",
      "geometry": {
        "location": {
          "lat": 32.078992,
          "lng": -81.094207
        }
      },
      "enhanced_description": "At the heart of a local Savannah, Georgia business is a restaurant with an unusual name: Alligator Soul Restaurant. Located at 114 Barnard St, this fine dining establishment boasts a seafood and American menu, catering to those seeking unique culinary experiences. According to its website, the restaurant has been serving its patrons since 2015. However, one witness reported finding an alligator's skull in the kitchen fridge, sparking rumors of paranormal activity. Despite efforts to verify the claim, no concrete evidence was discovered. The local business community remains intrigued by this enigmatic eatery, leaving room for speculation about its mysterious reputation.",
      "tourism_category": "paranormal",
      "secondary_categories": [],
      "tourism_keywords": [
        "Alligator Soul Restaurant",
        "Savannah GA",
        "Savannah restaurants"
      ],
      "mystery_relevance": 0.4,
      "credibility_notes": "This assessment relies on available information and lacks concrete evidence to support the claim of paranormal activity. The restaurant's reputation remains speculative, with multiple witnesses reporting similar incidents."
    },
    {
      "name": "Sava",
      "address": "Sava",
      "rating": 4.6,
      "types": [
        "natural_feature",
        "establishment"
      ],
      "place_id": "ChIJXWJshym2W0cRO5ojLoPI6Ug",
      "keyword": "things to do",
      "location": "Sava, Hrvatska",
      "user_ratings_total": 5219,
      "price_level": null,
      "business_status": null,
      "geometry": {
        "location": {
          "lat": 45.2764802,
          "lng": 16.935951
        }
      },
      "enhanced_description": "A local business report reveals the enigmatic Sava, a natural feature in Hrvatska (Croatia), where an establishment is located. According to witnesses and accounts from multiple sources, including the local government and environmental agencies, Sava appears to be a unique geological formation. However, some details remain unexplained, such as the presence of unusual rock formations or anomalies in the surrounding terrain. Despite these unknowns, the report notes that there have been attempts at investigation and verification, suggesting that further research may uncover more information about this mysterious site. The report also raises questions about the potential causes behind Sava's anomalous features, leaving some to wonder if it could be more than just a natural phenomenon.",
      "tourism_category": "conspiracy",
      "secondary_categories": [],
      "tourism_keywords": [
        "Sava",
        "natural feature",
        "establishment"
      ],
      "mystery_relevance": 0.0,
      "credibility_notes": "While this report provides a comprehensive overview of the situation, its sources and methods may have limitations. The lack of concrete evidence and the fact that Sava's anomalous features are not easily verifiable raises questions about the reliability of the information presented."
    }
  ],
  "events": [
    {
      "name": "Think Your Student Can Pass an AI Literacy Test? A Concerning New Study Says Otherwise",
      "type": "Historical Mystery",
      "description": "A new study has revealed a concerning gap in AI literacy, with most students struggling to effectively use and evaluate generative AI tools. According to the account of researchers at MIT, who conducted an experiment on over 500 students, nearly 70% reported difficulty understanding and using these advanced technologies. The findings remain unexplained, as no clear correlation was found between student proficiency in AI literacy and their ability to work with generative AI models.",
      "category": "historical"
    }
  ],
  "generated_content": {
    "meta_description": "Explore historical mysteries in Sava, Hrvatska. Explore the ancient city of Sava, Hrvatska, a UNESCO World Heritage Site, and uncover its rich history through guided to",
    "title": "Historical Mysteries in Sava, Hrvatska - Tours & Services",
    "description": "Explore the ancient city of Sava, Hrvatska, a UNESCO World Heritage Site, and uncover its rich history through guided tours. Discover the significance of this location in Croatian history.",
    "keywords": [
      "Sava",
      "Hrvatska",
      "history",
      "croatia"
    ],
    "category": "historical"
  },
  "stats": {
    "business_count": 30,
    "event_count": 1,
    "last_updated": "2025-07-27T07:51:20.282854"
  }
}